function rand1() {
    var x = Math.floor((Math.random() * 9) + 1);
    if (x == 1) {
        divr.innerHTML = "מספר 1: מורה על מנהיגות ,ניהול, יוזמה ופרסום. טוב לעצמאיים ולאנשי עסקים. מבחינה אנרגטית מחזק את הרעיוניות ומהווה סמן לפריצת דרך ולהתחלות חדשות. האנשים המתגוררים במספר 1 יהיו לרוב כריזמטיים ובעלי סטאטוס חברתי הנקשר עם כבוד וגאווה.";
    }
    if (x == 2) {
        divr.innerHTML = "מספר 2: מצביע על דואליות מובהקת- או שחור או לבן. מחד, עשוי להעניק תחושת חמימות ורוך , זוגיות בריאה וחיונית וחיי משפחה נינוחים. מאידך עלול להיות קיצוני עד כדי הרס התא המשפחתי, מחלוקות מריבות וכעסים. לעיתים ייתכנו בבית זה גירושין צורמים. אצל הנשים מחזק את הרגישות ואת הצד האימהי. ייתכן והמתגוררים בו יפתחו קנאה לפרטיותם תוך שמירת סודיות לגבי עיסוקם.";
    }
    if (x == 3) {
        divr.innerHTML = "מספר 3: מייצג את התוצאה שבאה מחיבור. אם האחד זכרי והשתיים נקבי אזי החיבור ביניהם מוליד פרי יצירה משותף וככזה מבטא את הצד הרענן והיצירתי. האנשים המתגוררים בבית זה יהיו קרוב לודאי פתוחים ומסבירי פנים. האנרגיה הזורמת בלב הבית מעידה על תחושת חופש ונדודים ולכן תדירות הנסיעות גבוהה באופן יחסי. בית עם פוטנציאל רב לשפע וברכה ומתאים לאנשים עסקים, עצמאיים ולאלה שעיסוקם בשירות הציבור.";
    }
    if (x == 4) {
        divr.innerHTML = "מספר 4: מבטא ארציות ,פיזיות  ומסגרות ברורות. משרה הרבה תחושת ביטחון ומעניק יציבות. דיירי הבית מביטים בעיקר אל המחר מתוך תחושת עצמאיות מלאה. מחפשים אהבה ושייכות אך אינם מרגישים שביעות רצון לכן תמיד יהיו בתנועה לשפר ולהיטיב.  לא פעם ימצאו את עצמם משנים מסגרת, כיוון ומקצוע. מניע את הצורך החומרי- כלכלי ועשוי להיות מנעו לצמיחה.";
    }
    if (x == 5) {
        divr.innerHTML = "מספר 5: מבטא שינויים תמידיים ותנועה. בית לא רגוע ומתאפיין בתנועיות גדולה ובדיברוים רבים. בית עם ברכה ומסמל פרסום על כל היבטיו ולכן טוב למי שעיסוקו דורש זאת. התקשורת על כל גווניה מהווה מוטיב מרכזי ובעלי הבית יהיו לרוב אנשי הדרכה,טיפול ,היי טק ועסקים. לצד היותו מלא אנרגיה חיובית יש להתמקד בשליטה ביצרים ולהישמר מבעיות בריאות, תזונה נכונה ומחלוקות משפחתיות. לרבות פגיעת עין רעה קשה מהסביבה הקרובה. ";
    }
    if (x == 6) {
        divr.innerHTML = "מספר 6: כנראה מדובר בבית נאה ומטופח. בית חם ומשפחתי עד מאוד. מסמל קשר הדוק בין בני הבית, הרמוניה וקירוב לבבות. קיים דגש עיקרי על ארוחות גדולות והכנסת אורחים מכובדת. הזוגיות מהווה נושא מרכזי ולרוב קוטבית : זוגיות בריאה וחמה או הרסנית עד לחורבן. דיירי הבית משדרים כלפי חוץ  אולם הפנימיות שונה לחלוטין. הנשים יהיו הצד החזק והדומיננטי בבית וישמיעו את דעתן בצורה עניינית.לכן מומלץ לגברים להתחשב בדעתן. יש לעשות פעולות רוחניות כנגד לשונות רעות הנובעות מקנאה.";
    }
    if (x == 7) {
        divr.innerHTML = "מספר 7: במהותו אינו דומה לאף בית אחר. מייצג פשטות צניעות ונעימות. בעל אווירה רוחנית – מיסטית ולכן אינו נקשר בהכרח להצלחה חומרית. לעיתים קרובות מבטא תקשורת לקויה וחוסר סבלנות בין בני הבית. מצביע על קיצוניות תהומית ,מחד עשוי להיות בעל שפע רב ומאידך עלול להיות שלילי עד כדי נטייה לבעיות בריאות ופרנסה. ";
    }
    if (x == 8) {
        divr.innerHTML = "מספר 8: מתאפיין בסגירות ובתחושת כובד. מייצג את האין סוף, כוח עוצמה וסמכות. בשונה מהמס' 7 הרוחני המס' 8 מבטא את העולם החומרי והפרקטי. מתאפיין במחזוריות , במעגליות ובכרוניקה של מצבים עצורים. לרוב , האווירה בבית זה פסימית וחסרת שמחת חיים. מתאפיין בשגרה חונקת ובנוקשות רבה.";
    }
    if (x == 9) {
        divr.innerHTML = "מספר 9: בית אקטיבי ואנרגטי מאוד. האווירה בו דינאמית ודייריו חיים בתחושת נעורים נצחיים. מתאפיין בדיבורים רבים ובפטפטנות הגובלת ברכילות. בני הבית יהיו אינדיבידואליים ויתעקשו להשיג ולבטא את רצונם. בעלי הבית יהיו עם לב פתוח תוך דגש על הכנסת אורחים. חוסר סבלנות , מאבקי כוחות ומרדנות הינם מוטיבים מרכזיים ומבטאים חלק עיקרי בהתנהלות הרוחנית בתא המשפחתי. בית חופשי ממגבלות ולעיתים אף חסר גבולות. ";
    }
    if (x == 10) {
        divr.innerHTML = "לא קיים מספר בית כזה, לחצו עוד פעם";
    }
}